#01. Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

#02. Importing data

In [6]:
# orders data frame
df = pd.read_csv(r'C:\Users\Brooke\05-2022 Instacart Basket Analysis\Data\Original Data\orders[1].csv', index_col = False)

In [9]:
path = r'C:\Users\Brooke\05-2022 Instacart Basket Analysis'

In [10]:
path

'C:\\Users\\Brooke\\05-2022 Instacart Basket Analysis'

In [11]:
df.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [12]:
df.tail()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [13]:
df.shape

(3421083, 7)

In [14]:
df = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'orders[1].csv'), nrows=1000)

In [15]:
vars_list = ['order_id', 'user_id', 'order_number', 'order_dow', 'order_hour_of_day', 'days_since_prior_order']

In [17]:
vars_list

['order_id',
 'user_id',
 'order_number',
 'order_dow',
 'order_hour_of_day',
 'days_since_prior_order']

In [16]:
df = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'orders[1].csv'), usecols = vars_list)

In [18]:
df.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0